In [1]:
import numpy as np
import pandas as pd

In [2]:
# 인코딩 변환 방식 utf-8, utf-16, euc-kr,cp949
df = pd.read_csv("C:\\Users\\pc\\Downloads\\양양군_데이터\\2022년_1월-12월\\성연령별_소비금액.csv",encoding='utf-16')

In [3]:
df

       성별       남성     여성
0     연령대     소비금액   소비금액
1  20대 이하    176백만  183백만
2     30대    468백만  396백만
3     40대    742백만  410백만
4     50대    858백만  482백만
5  60대 이상  1,080백만  545백만

In [4]:
# 첫번째 행에 우리가 원하는 컬럼이 들어가있으므로 
# 첫번째 행을 컬럼으로 만들기 

# 첫 행을 변수에 넣어두고
new_header= df.iloc[0]

# 첫번째 행을 제외한 내용을 슬라이싱방법을 이용하여 잘라냄
df = df[1:]

# 그후 첫행을 df의 컬럼으로 지정
df.columns = new_header

#df 표시
df

0     연령대     소비금액   소비금액
1  20대 이하    176백만  183백만
2     30대    468백만  396백만
3     40대    742백만  410백만
4     50대    858백만  482백만
5  60대 이상  1,080백만  545백만

In [5]:
# df 정보보기
# 컬럼이 연령대, 소비금액, 소비금액으로 이루어져 있는걸 볼수있음
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연령대     5 non-null      object
 1   소비금액    5 non-null      object
 2   소비금액    5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [6]:
# 남성, 여성 소비금액으로 열컬럼 변경 


df.columns = ['연령대', '남성_소비금액', '여성_소비금액']
df

      연령대  남성_소비금액 여성_소비금액
1  20대 이하    176백만   183백만
2     30대    468백만   396백만
3     40대    742백만   410백만
4     50대    858백만   482백만
5  60대 이상  1,080백만   545백만

In [7]:

# 소비금액의 값들의 백만을 숫자로 변경
df.남성_소비금액 = df.남성_소비금액.str.replace('백만', '000000')
df.남성_소비금액 = df.남성_소비금액.str.replace(',', '')
df.여성_소비금액 = df.여성_소비금액.str.replace('백만', '000000')
# 여성소비금액에는 콤마가 없으므로 
# df.여성_소비금액 = df.여성_소비금액.str.replace(',', '')
df

C:\Users\pc\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

      연령대     남성_소비금액    여성_소비금액
1  20대 이하   176000000  183000000
2     30대   468000000  396000000
3     40대   742000000  410000000
4     50대   858000000  482000000
5  60대 이상  1080000000  545000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   연령대      5 non-null      object
 1   남성_소비금액  5 non-null      object
 2   여성_소비금액  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [13]:
#df.여성_소비금액.astype('int') # 너무커서 안될때 밑의 코드사용 

#df.여성_소비금액=pd.to_numeric(df['여성_소비금액'])
#df.남성_소비금액=pd.to_numeric(df['남성_소비금액'])

C:\Users\pc\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [10]:
df.여성_소비금액=df.여성_소비금액.astype('int')
df.남성_소비금액=df.남성_소비금액.astype('int')

C:\Users\pc\anaconda3\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [14]:
df

      연령대     남성_소비금액    여성_소비금액
1  20대 이하   176000000  183000000
2     30대   468000000  396000000
3     40대   742000000  410000000
4     50대   858000000  482000000
5  60대 이상  1080000000  545000000

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   연령대      5 non-null      object
 1   남성_소비금액  5 non-null      int32
 2   여성_소비금액  5 non-null      int32
dtypes: int32(2), object(1)
memory usage: 212.0+ bytes

In [17]:
df.to_csv('성연령별_소비금액_전처리.csv')